import sqlite3
'1 Знайти 5 студентів із найбільшим середнім балом з усіх предметів.'
'2 Знайти студента із найвищим середнім балом з певного предмета.'
'3 Знайти середній бал у групах з певного предмета.'
'4 Знайти середній бал на потоці (по всій таблиці оцінок).'
'5 Знайти які курси читає певний викладач.'
'6 Знайти список студентів у певній групі.'
'7 Знайти оцінки студентів у окремій групі з певного предмета.'
'8 Знайти середній бал, який ставить певний викладач зі своїх предметів.'
'9 Знайти список курсів, які відвідує студент.'
'10 Список курсів, які певному студенту читає певний викладач.'
# Подключение к базе данных
conn = sqlite3.connect('\pythonProject1\my_database.db')
cursor = conn.cursor()
number_files=input('Enter number files 1-10: ')
file=f'query_{number_files}.sql'
# Чтение SQL запроса из файла
with open(file, 'r') as file:
    sql_query = file.read()

# Выполнение запроса
cursor.execute(sql_query)

# Получение результатов
results = cursor.fetchall()
print(results)

# Закрытие соединения с базой данных
conn.close()


